const loadData = () => {
    return {
        "traits": [
            "Активный",
            "Без учения нет умения",
            "Безумный",
            "Веган",
            "Веселый",
            "Вечное дитя",
            "Влюбчивый",
            "Высокие запросы",
            "Гений",
            "Гик",
            "Гурман",
            "Дитя океана",
            "Дитя острова",
            "Добрый",
            "Достигатор",
            "Дружелюбный",
            "Душа компании",
            "Задира",
            "Злой",
            "Инсайдер",
            "Искусствовед",
            "Карьерист",
            "Клептоман",
            "Книжный червь",
            "Кринжовый",
            "Лежебока",
            "Любит кошек",
            "Любит природу",
            "Любит собак",
            "Любовь к животным",
            "Любопытный",
            "Меломан",
            "Мудрый",
            "Недотрога",
            "Неловкий в общении",
            "Непер. лактозы",
            "Непостоянный",
            "Неряха",
            "Неуклюжий",
            "Обжора",
            "Одиночка",
            "Осторожный в любви",
            "Отважный",
            "Параноик",
            "Переработчик",
            "Перфекционист",
            "Практичный",
            "Преданный",
            "Привереда",
            "Против детей",
            "Растяпа",
            "Ревнивый",
            "Романтик",
            "Самоуверенный",
            "Свой в доску",
            "Семьянин",
            "Сноб",
            "Танцмашина",
            "Творец",
            "Тяга к корням",
            "Уважительный",
            "Угрюмый",
            "Умелец",
            "Фриган",
            "Холерик",
            "Чистюля",
            "Щедрый",
            "Эгоцентричный",
            "Экоэнтузиаст"
        ],
        "categories": [
            {
                "name": "Дружба - Характер",
                "values": [
                    {
                        "value": "Домоседы",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Идеалисты",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": -1
                            },
                            {
                                "trait": "Искусствовед",
                                "weight": 1
                            },
                            {
                                "trait": "Меломан",
                                "weight": 1
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Идущ. на поводу у эмоц.",
                        "map": [
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Интеллектуалы",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -1
                            },
                            {
                                "trait": "Творец",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Любители питомцев",
                        "map": [
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Любит кошек",
                                "weight": 1
                            },
                            {
                                "trait": "Любит собак",
                                "weight": 1
                            },
                            {
                                "trait": "Любовь к животным",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любители спорить",
                        "map": [
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Неамбициозные",
                        "map": [
                            {
                                "trait": "Неряха",
                                "weight": 1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Одухотворенные",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Оптимисты",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Добрый",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Пессимисты",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Преданные семье",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Проказники",
                        "map": [
                            {
                                "trait": "Клептоман",
                                "weight": 1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Трудолюбивые",
                        "map": [
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": -1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": 1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Ценители природы",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Ценители романтики",
                        "map": [
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Эгоисты",
                        "map": [
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Энергичные",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Юмористы",
                        "map": [
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Дружба - Темы разговора",
                "values": [
                    {
                        "value": "Глубокие мысли",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": -1
                            },
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": 1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -1
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Жалобы",
                        "map": [
                            {
                                "trait": "Весёлый",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Истории",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Комплименты",
                        "map": [
                            {
                                "trait": "Добрый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Задира",
                                "weight": -1
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            },
                            {
                                "trait": "Уважительный",
                                "weight": 1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любовь",
                        "map": [
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Добрый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Нелепое поведение",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": 1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Непотребные шутки",
                        "map": [
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Обман",
                        "map": [
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Клептоман",
                                "weight": 1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Обсуждение интересов",
                        "map": [
                            {
                                "trait": "Весёлый",
                                "weight": 1
                            },
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Обсуждение увлечений",
                        "map": [
                            {
                                "trait": "Весёлый",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Плохие поступки",
                        "map": [
                            {
                                "trait": "Весёлый",
                                "weight": -1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": -1
                            },
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Светские беседы",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": -1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": -1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -1
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Сплетни",
                        "map": [
                            {
                                "trait": "Любопытный",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": 1
                            },
                            {
                                "trait": "Практичный",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Ссоры",
                        "map": [
                            {
                                "trait": "Весёлый",
                                "weight": -1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": -1
                            },
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Физическая близость",
                        "map": [
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Флирт",
                        "map": [
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Шалости",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Шутки",
                        "map": [
                            {
                                "trait": "Весёлый",
                                "weight": 1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Любовь - Характер",
                "values": [
                    {
                        "value": "Бойкость",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -2
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -3
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -3
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -2
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Веселый характер",
                        "map": [
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Домоседство",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -3
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -2
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": 1
                            },
                            {
                                "trait": "Отважный",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Идеализм",
                        "map": [
                            {
                                "trait": "Искусствовед",
                                "weight": 1
                            },
                            {
                                "trait": "Меломан",
                                "weight": 1
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Интеллектуалы",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": -1
                            },
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Карьерн. амбиции",
                        "map": [
                            {
                                "trait": "Достигатор",
                                "weight": 1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Фриган",
                                "weight": -1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любовь к питомцам",
                        "map": [
                            {
                                "trait": "Любит кошек",
                                "weight": 1
                            },
                            {
                                "trait": "Любит собак",
                                "weight": 1
                            },
                            {
                                "trait": "Любовь к животным",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любовь к природе",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            },
                            {
                                "trait": "Переработчик",
                                "weight": 1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            },
                            {
                                "trait": "Фриган",
                                "weight": 1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любовь к спорам",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": -1
                            },
                            {
                                "trait": "Добрый",
                                "weight": -2
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Любовь к чистоте",
                        "map": [
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": -2
                            },
                            {
                                "trait": "Обжора",
                                "weight": -1
                            },
                            {
                                "trait": "Привереда",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Неаккуратность",
                        "map": [
                            {
                                "trait": "Неряха",
                                "weight": 1
                            },
                            {
                                "trait": "Обжора",
                                "weight": 1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Оптимизм",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Добрый",
                                "weight": 1
                            },
                            {
                                "trait": "Задира",
                                "weight": -2
                            },
                            {
                                "trait": "Злой",
                                "weight": -2
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Отсутств. амбиций",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": -1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": -1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Неряха",
                                "weight": 1
                            },
                            {
                                "trait": "Отважный",
                                "weight": -1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -1
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Пессимизм",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": -2
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -3
                            },
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -1
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": 1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": 1
                            },
                            {
                                "trait": "Преданный",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": -2
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Подв. влиян. эмоц.",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": 1
                            },
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Параноик",
                                "weight": 1
                            },
                            {
                                "trait": "Преданный",
                                "weight": -1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Семейн. ценности",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -2
                            },
                            {
                                "trait": "Преданный",
                                "weight": 1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -2
                            },
                            {
                                "trait": "Семьянин",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Трудолюбие",
                        "map": [
                            {
                                "trait": "Достигатор",
                                "weight": -1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -3
                            },
                            {
                                "trait": "Неряха",
                                "weight": -1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Эгоизм",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": -1
                            },
                            {
                                "trait": "Высокие запросы",
                                "weight": 1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": 1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -1
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Энергичность",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Отважный",
                                "weight": 1
                            },
                            {
                                "trait": "Танцмашина",
                                "weight": 1
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Любовь - Навыки",
                "values": [
                    {
                        "value": "Бедность",
                        "map": [
                            {
                                "trait": "Достигатор",
                                "weight": -1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Богатство",
                        "map": [
                            {
                                "trait": "Достигатор",
                                "weight": 1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "В отношениях",
                        "map": [
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Преданный",
                                "weight": -1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Выступления на сцене",
                        "map": [
                            {
                                "trait": "Меломан",
                                "weight": 1
                            },
                            {
                                "trait": "Танцмашина",
                                "weight": 1
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Здоровье и спорт",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": 1
                            },
                            {
                                "trait": "Высокие запросы",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Отважный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Инженерное дело",
                        "map": [
                            {
                                "trait": "Умелец",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Карьерные достиж.",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": 1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Кулинария",
                        "map": [
                            {
                                "trait": "Гурман",
                                "weight": 1
                            },
                            {
                                "trait": "Обжора",
                                "weight": 1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Лень",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": -1
                            },
                            {
                                "trait": "Высокие запросы",
                                "weight": -1
                            },
                            {
                                "trait": "Гений",
                                "weight": -1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": -1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Отважный",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": -1
                            },
                            {
                                "trait": "Умелец",
                                "weight": -1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Межлич. общение",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Мультимед. И тех.",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Наука",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Приготов. Напитков",
                        "map": [
                            {
                                "trait": "Гурман",
                                "weight": 1
                            },
                            {
                                "trait": "Обжора",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Природа",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Развитые навыки",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": 1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": 1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Творчество и рукодел.",
                        "map": [
                            {
                                "trait": "Искусствовед",
                                "weight": 1
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Фриланс",
                        "map": [
                            {
                                "trait": "Достигатор",
                                "weight": -1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Практичный",
                                "weight": -1
                            },
                            {
                                "trait": "Фриган",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Чувство юмора",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            }
                        ]
                    }
                ]
            }
        ],
        "compatibilities": [
            {
                "name": "Любовь",
                "values": [
                    {
                        "value": "Активный",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": 2
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -1
                            },
                            {
                                "trait": "Отважный",
                                "weight": 1
                            },
                            {
                                "trait": "Танцмашина",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Без учения нет умения",
                        "map": [
                            {
                                "trait": "Без учения нет умения",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Безумный",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": 2
                            },
                            {
                                "trait": "Гений",
                                "weight": -1
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Параноик",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Веган",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 2
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            },
                            {
                                "trait": "Переработчик",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": 1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Веселый",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": -1
                            },
                            {
                                "trait": "Веселый",
                                "weight": 2
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Добрый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Задира",
                                "weight": -1
                            },
                            {
                                "trait": "Злой",
                                "weight": -2
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Кариерист",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -2
                            },
                            {
                                "trait": "Параноик",
                                "weight": -2
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -2
                            },
                            {
                                "trait": "Холерик",
                                "weight": -2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Вечное дитя",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": 2
                            },
                            {
                                "trait": "Высокие запросы",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": -1
                            },
                            {
                                "trait": "Злой",
                                "weight": -2
                            },
                            {
                                "trait": "Любопытный",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": -1
                            },
                            {
                                "trait": "Преданный",
                                "weight": 1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -2
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Влюбчивый",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": -1
                            },
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 2
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -2
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -2
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -2
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -2
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Высокие запросы",
                        "map": [
                            {
                                "trait": "Высокие запросы",
                                "weight": 2
                            },
                            {
                                "trait": "Любопытный",
                                "weight": 1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Гений",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": 2
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Гик",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": 2
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Гурман",
                        "map": [
                            {
                                "trait": "Гурман",
                                "weight": 2
                            },
                            {
                                "trait": "Обжора",
                                "weight": -2
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Дитя океана",
                        "map": [
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            },
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": 2
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": 1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 1
                            },
                            {
                                "trait": "Переработчик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Дитя острова",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": 2
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            },
                            {
                                "trait": "Переработчик",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -2
                            },
                            {
                                "trait": "Фриган",
                                "weight": 1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Добрый",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Добрый",
                                "weight": 2
                            },
                            {
                                "trait": "Задира",
                                "weight": -2
                            },
                            {
                                "trait": "Злой",
                                "weight": -2
                            },
                            {
                                "trait": "Кариерист",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Достигатор",
                        "map": [
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": 2
                            },
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": 1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Дружелюбный",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": -1
                            },
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -2
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -2
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -2
                            },
                            {
                                "trait": "Параноик",
                                "weight": -2
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Душа компании",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 2
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -2
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Задира",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Добрый",
                                "weight": -2
                            },
                            {
                                "trait": "Задира",
                                "weight": 2
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Кариерист",
                                "weight": -1
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -2
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Злой",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": -2
                            },
                            {
                                "trait": "Добрый",
                                "weight": -2
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": 2
                            },
                            {
                                "trait": "Кариерист",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": 1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Параноик",
                                "weight": 1
                            },
                            {
                                "trait": "Преданный",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Инсайдер",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 2
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -2
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Искусствовед",
                        "map": [
                            {
                                "trait": "Искусствовед",
                                "weight": 2
                            },
                            {
                                "trait": "Меломан",
                                "weight": 1
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Карьерист",
                        "map": [
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": 1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": 2
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Клептоман",
                        "map": [
                            {
                                "trait": "Добрый",
                                "weight": -2
                            },
                            {
                                "trait": "Клептоман",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Книжный червь",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 2
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Кринжовый",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Гений",
                                "weight": -1
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 2
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -2
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Лежебока",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": -2
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": -2
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -2
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 1
                            },
                            {
                                "trait": "Неряха",
                                "weight": 1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": 1
                            },
                            {
                                "trait": "Отважный",
                                "weight": -2
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": -1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -1
                            },
                            {
                                "trait": "Танцмашина",
                                "weight": -1
                            },
                            {
                                "trait": "Умелец",
                                "weight": -2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Любит кошек",
                        "map": [
                            {
                                "trait": "Любит кошек",
                                "weight": 2
                            },
                            {
                                "trait": "Любит собак",
                                "weight": 1
                            },
                            {
                                "trait": "Любовь к животным",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любит природу",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 2
                            },
                            {
                                "trait": "Переработчик",
                                "weight": 1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": 1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любит собак",
                        "map": [
                            {
                                "trait": "Любит кошек",
                                "weight": 1
                            },
                            {
                                "trait": "Любит собак",
                                "weight": 2
                            },
                            {
                                "trait": "Любовь к животным",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любовь к животным",
                        "map": [
                            {
                                "trait": "Любит кошек",
                                "weight": 1
                            },
                            {
                                "trait": "Любит собак",
                                "weight": 1
                            },
                            {
                                "trait": "Любовь к животным",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Любопытный",
                        "map": [
                            {
                                "trait": "Высокие запросы",
                                "weight": 1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": 2
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Меломан",
                        "map": [
                            {
                                "trait": "Искусствовед",
                                "weight": 1
                            },
                            {
                                "trait": "Меломан",
                                "weight": 2
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Мудрый",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": -2
                            },
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -1
                            },
                            {
                                "trait": "Высокие запросы",
                                "weight": -1
                            },
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": -1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": 2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -2
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Недотрога",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -1
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": 2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -2
                            },
                            {
                                "trait": "Параноик",
                                "weight": 1
                            },
                            {
                                "trait": "Против детей",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -2
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Неловкий в общении",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -1
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -2
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -2
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 2
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Непер. лактозы",
                        "map": [
                            {
                                "trait": "Непер. лактозы",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Непостоянный",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": 1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": 1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 2
                            },
                            {
                                "trait": "Параноик",
                                "weight": 1
                            },
                            {
                                "trait": "Преданный",
                                "weight": -2
                            },
                            {
                                "trait": "Против детей",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": -2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Неряха",
                        "map": [
                            {
                                "trait": "Достигатор",
                                "weight": -1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -2
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Неряха",
                                "weight": 2
                            },
                            {
                                "trait": "Обжора",
                                "weight": 1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": -1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Неуклюжий",
                        "map": [
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": 1
                            },
                            {
                                "trait": "Умелец",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Обжора",
                        "map": [
                            {
                                "trait": "Гурман",
                                "weight": -2
                            },
                            {
                                "trait": "Неряха",
                                "weight": 1
                            },
                            {
                                "trait": "Обжора",
                                "weight": 2
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Одиночка",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -2
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -2
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 2
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Осторожный в любви",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -2
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -1
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": 2
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -2
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Отважный",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -1
                            },
                            {
                                "trait": "Отважный",
                                "weight": 2
                            },
                            {
                                "trait": "Танцмашина",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Параноик",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": 1
                            },
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -2
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -1
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": 1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Параноик",
                                "weight": 2
                            },
                            {
                                "trait": "Против детей",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Переработчик",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            },
                            {
                                "trait": "Переработчик",
                                "weight": 2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": 1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Перфекционист",
                        "map": [
                            {
                                "trait": "Достигатор",
                                "weight": 1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": 2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Практичный",
                        "map": [
                            {
                                "trait": "Высокие запросы",
                                "weight": 1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": 1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 2
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -2
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Преданный",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": -1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -2
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Преданный",
                                "weight": 2
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Привереда",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": -2
                            },
                            {
                                "trait": "Неряха",
                                "weight": -2
                            },
                            {
                                "trait": "Обжора",
                                "weight": -2
                            },
                            {
                                "trait": "Переработчик",
                                "weight": -2
                            },
                            {
                                "trait": "Привереда",
                                "weight": 2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Против детей",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": -2
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": 1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Параноик",
                                "weight": 1
                            },
                            {
                                "trait": "Преданный",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": 2
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": -2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Растяпа",
                        "map": [
                            {
                                "trait": "Высокие запросы",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 2
                            },
                            {
                                "trait": "Сноб",
                                "weight": -2
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Ревнивый",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -1
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": 1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Параноик",
                                "weight": 1
                            },
                            {
                                "trait": "Против детей",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 2
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Романтик",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -2
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 2
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Самоуверенный",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Свой в доску",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Семьянин",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": -1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -2
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Преданный",
                                "weight": 1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -2
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": 2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Сноб",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": -1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": -2
                            },
                            {
                                "trait": "Высокие запросы",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": -1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": -1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": 1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -2
                            },
                            {
                                "trait": "Переработчик",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            },
                            {
                                "trait": "Преданный",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -2
                            },
                            {
                                "trait": "Семьянин",
                                "weight": -1
                            },
                            {
                                "trait": "Сноб",
                                "weight": 2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": 1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Танцмашина",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": 1
                            },
                            {
                                "trait": "Отважный",
                                "weight": 1
                            },
                            {
                                "trait": "Танцмашина",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Творец",
                        "map": [
                            {
                                "trait": "Искусствовед",
                                "weight": 1
                            },
                            {
                                "trait": "Меломан",
                                "weight": 1
                            },
                            {
                                "trait": "Творец",
                                "weight": 2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Тягя к корням",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": -2
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": 1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": 1
                            },
                            {
                                "trait": "Преданный",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Уважительный",
                        "map": [
                            {
                                "trait": "Задира",
                                "weight": -2
                            },
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -2
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": -2
                            },
                            {
                                "trait": "Обжора",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -1
                            },
                            {
                                "trait": "Уважительный",
                                "weight": 2
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Угрюмый",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": -1
                            },
                            {
                                "trait": "Веселый",
                                "weight": -2
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -1
                            },
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -2
                            },
                            {
                                "trait": "Задира",
                                "weight": -1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Кариерист",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 2
                            },
                            {
                                "trait": "Холерик",
                                "weight": -2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Умелец",
                        "map": [
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Неуклюжый",
                                "weight": -2
                            },
                            {
                                "trait": "Умелец",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Фриган",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Высокие запросы",
                                "weight": -1
                            },
                            {
                                "trait": "Гурман",
                                "weight": -2
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": 1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": -1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -2
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": -1
                            },
                            {
                                "trait": "Переработчик",
                                "weight": 1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": -2
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            },
                            {
                                "trait": "Сноб",
                                "weight": -2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": 2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": -1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Холерик",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": 1
                            },
                            {
                                "trait": "Веселый",
                                "weight": -2
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -1
                            },
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Инсайдер",
                                "weight": -1
                            },
                            {
                                "trait": "Кариерист",
                                "weight": -1
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -2
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -2
                            },
                            {
                                "trait": "Холерик",
                                "weight": 2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Чистюля",
                        "map": [
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": 1
                            },
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": -2
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Обжора",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": -1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": 1
                            },
                            {
                                "trait": "Привереда",
                                "weight": 1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Щедрый",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Добрый",
                                "weight": 1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": 1
                            },
                            {
                                "trait": "Задира",
                                "weight": -2
                            },
                            {
                                "trait": "Злой",
                                "weight": -2
                            },
                            {
                                "trait": "Искусствовед",
                                "weight": 1
                            },
                            {
                                "trait": "Кариерист",
                                "weight": 1
                            },
                            {
                                "trait": "Меломан",
                                "weight": 1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Обжора",
                                "weight": -2
                            },
                            {
                                "trait": "Параноик",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": -2
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Эгоцентричный",
                        "map": [
                            {
                                "trait": "Высокие запросы",
                                "weight": 1
                            },
                            {
                                "trait": "Любопытный",
                                "weight": 1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            },
                            {
                                "trait": "Эгоцентричный",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Экоэнтузиаст",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя океана",
                                "weight": 1
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            },
                            {
                                "trait": "Переработчик",
                                "weight": 1
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": 1
                            },
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 2
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Дружба",
                "values": [
                    {
                        "value": "Активный",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": 2
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Без учения нет умения",
                        "map": [
                            {
                                "trait": "Без учения нет умения",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Безумный",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": 2
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Веган",
                        "map": [
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Веселый",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 2
                            },
                            {
                                "trait": "Добрый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Против детей",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -2
                            },
                            {
                                "trait": "Холерик",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Вечное дитя",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": 2
                            },
                            {
                                "trait": "Злой",
                                "weight": -2
                            },
                            {
                                "trait": "Против детей",
                                "weight": -2
                            },
                            {
                                "trait": "Семьянин",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Влюбчивый",
                        "map": [
                            {
                                "trait": "Влюбчивый",
                                "weight": 2
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -2
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -2
                            },
                            {
                                "trait": "Осторож. в любви",
                                "weight": -2
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Высокие запросы",
                        "map": [
                            {
                                "trait": "Высокие запросы",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Гений",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": 2
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Искусствовед",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Меломан",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -1
                            },
                            {
                                "trait": "Творец",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Гик",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": 2
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -1
                            },
                            {
                                "trait": "Творец",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Гурман",
                        "map": [
                            {
                                "trait": "Гурман",
                                "weight": 2
                            },
                            {
                                "trait": "Обжора",
                                "weight": -2
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Дитя океана",
                        "map": [
                            {
                                "trait": "Дитя океана",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Дитя острова",
                        "map": [
                            {
                                "trait": "Дитя острова",
                                "weight": 2
                            },
                            {
                                "trait": "Тяга к корням",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Добрый",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Добрый",
                                "weight": 2
                            },
                            {
                                "trait": "Задира",
                                "weight": -2
                            },
                            {
                                "trait": "Злой",
                                "weight": -2
                            },
                            {
                                "trait": "Практичный",
                                "weight": -1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Достигатор",
                        "map": [
                            {
                                "trait": "Достигатор",
                                "weight": 2
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Дружелюбный",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 2
                            },
                            {
                                "trait": "Нелов. в общении",
                                "weight": -2
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -2
                            },
                            {
                                "trait": "Осторож. в любви",
                                "weight": -2
                            },
                            {
                                "trait": "Параноик",
                                "weight": -2
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Душа компании",
                        "map": [
                            {
                                "trait": "Душа компании",
                                "weight": 2
                            },
                            {
                                "trait": "Нелов. в общении",
                                "weight": -2
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -2
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Задира",
                        "map": [
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": 2
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Злой",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": -2
                            },
                            {
                                "trait": "Добрый",
                                "weight": -2
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": 2
                            },
                            {
                                "trait": "Любит кошек",
                                "weight": -1
                            },
                            {
                                "trait": "Любит собак",
                                "weight": -1
                            },
                            {
                                "trait": "Любовь к животным",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Инсайдер",
                        "map": [
                            {
                                "trait": "Инсайдер",
                                "weight": 2
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Искусствовед",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": -1
                            },
                            {
                                "trait": "Искусствовед",
                                "weight": 2
                            },
                            {
                                "trait": "Меломан",
                                "weight": 1
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Карьерист",
                        "map": [
                            {
                                "trait": "Карьерист",
                                "weight": 2
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Неряха",
                                "weight": -1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Клептоман",
                        "map": [
                            {
                                "trait": "Добрый",
                                "weight": -2
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Клептоман",
                                "weight": 2
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Сноб",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Книжный червь",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": -1
                            },
                            {
                                "trait": "Гений",
                                "weight": 1
                            },
                            {
                                "trait": "Гик",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 2
                            },
                            {
                                "trait": "Любит природу",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -1
                            },
                            {
                                "trait": "Творец",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Кринжовый",
                        "map": [
                            {
                                "trait": "Кринжовый",
                                "weight": 2
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -2
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Лежебока",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": -2
                            },
                            {
                                "trait": "Веган",
                                "weight": -1
                            },
                            {
                                "trait": "Достигатор",
                                "weight": -2
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -2
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 2
                            },
                            {
                                "trait": "Любит природу",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": 1
                            },
                            {
                                "trait": "Отважный",
                                "weight": -2
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": -1
                            },
                            {
                                "trait": "Умелец",
                                "weight": -2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Любит кошек",
                        "map": [
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Любит кошек",
                                "weight": 2
                            },
                            {
                                "trait": "Любит собак",
                                "weight": 1
                            },
                            {
                                "trait": "Любовь к животным",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любит природу",
                        "map": [
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": -1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": -1
                            },
                            {
                                "trait": "Активный",
                                "weight": 1
                            },
                            {
                                "trait": "Веган",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": 2
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Любит собак",
                        "map": [
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Любит кошек",
                                "weight": 1
                            },
                            {
                                "trait": "Любит собак",
                                "weight": 2
                            },
                            {
                                "trait": "Любовь к животным",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Любовь к животным",
                        "map": [
                            {
                                "trait": "Злой",
                                "weight": -1
                            },
                            {
                                "trait": "Любит кошек",
                                "weight": 1
                            },
                            {
                                "trait": "Любит собак",
                                "weight": 1
                            },
                            {
                                "trait": "Любовь к животным",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Любопытный",
                        "map": [
                            {
                                "trait": "Любопытный",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Меломан",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": -1
                            },
                            {
                                "trait": "Искусствовед",
                                "weight": 1
                            },
                            {
                                "trait": "Меломан",
                                "weight": 2
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Мудрый",
                        "map": [
                            {
                                "trait": "Безумный",
                                "weight": -2
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -2
                            },
                            {
                                "trait": "Мудрый",
                                "weight": 2
                            },
                            {
                                "trait": "Сноб",
                                "weight": -2
                            },
                            {
                                "trait": "Холерик",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Недотрога",
                        "map": [
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Недотрога",
                                "weight": 2
                            },
                            {
                                "trait": "Осторож. в любви",
                                "weight": 2
                            },
                            {
                                "trait": "Романтик",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Неловкий в общении",
                        "map": [
                            {
                                "trait": "Дружелюбный",
                                "weight": -2
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -2
                            },
                            {
                                "trait": "Неловкий в общении",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Непер. лактозы",
                        "map": [
                            {
                                "trait": "Непер. лактозы",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Непостоянный",
                        "map": [
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 2
                            },
                            {
                                "trait": "Преданный",
                                "weight": -2
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Романтик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": -2
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Неряха",
                        "map": [
                            {
                                "trait": "Карьерист",
                                "weight": -1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": 1
                            },
                            {
                                "trait": "Неряха",
                                "weight": 2
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": -1
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            },
                            {
                                "trait": "Уважительный",
                                "weight": -2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Неуклюжий",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": -1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 2
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 1
                            },
                            {
                                "trait": "Умелец",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Обжора",
                        "map": [
                            {
                                "trait": "Гурман",
                                "weight": -2
                            },
                            {
                                "trait": "Обжора",
                                "weight": 2
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Одиночка",
                        "map": [
                            {
                                "trait": "Активный",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -2
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -2
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": 1
                            },
                            {
                                "trait": "Любит природу",
                                "weight": -1
                            },
                            {
                                "trait": "Неуклюжий",
                                "weight": 1
                            },
                            {
                                "trait": "Одиночка",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Осторожный в любви",
                        "map": [
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -2
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -2
                            },
                            {
                                "trait": "Осторожный в любви",
                                "weight": 2
                            },
                            {
                                "trait": "Романтик",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Отважный",
                        "map": [
                            {
                                "trait": "Отважный",
                                "weight": 2
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Параноик",
                        "map": [
                            {
                                "trait": "Параноик",
                                "weight": 2
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Переработчик",
                        "map": [
                            {
                                "trait": "Переработчик",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Перфекционист",
                        "map": [
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -1
                            },
                            {
                                "trait": "Неряха",
                                "weight": -1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": 2
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Практичный",
                        "map": [
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Практичный",
                                "weight": 2
                            },
                            {
                                "trait": "Сноб",
                                "weight": 1
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Преданный",
                        "map": [
                            {
                                "trait": "Непостоянный",
                                "weight": -2
                            },
                            {
                                "trait": "Преданный",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Привереда",
                        "map": [
                            {
                                "trait": "Любит природу",
                                "weight": -2
                            },
                            {
                                "trait": "Неряха",
                                "weight": -2
                            },
                            {
                                "trait": "Обжора",
                                "weight": -2
                            },
                            {
                                "trait": "Привереда",
                                "weight": 2
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Против детей",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Вечное дитя",
                                "weight": -2
                            },
                            {
                                "trait": "Против детей",
                                "weight": 2
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Семьянин",
                                "weight": -2
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Растяпа",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": -1
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Клептоман",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 2
                            },
                            {
                                "trait": "Сноб",
                                "weight": -2
                            },
                            {
                                "trait": "Творец",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Ревнивый",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -1
                            },
                            {
                                "trait": "Влюбчивый",
                                "weight": -2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Против детей",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 2
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 1
                            },
                            {
                                "trait": "Холерик",
                                "weight": 1
                            }
                        ]
                    },
                    {
                        "value": "Романтик",
                        "map": [
                            {
                                "trait": "Романтик",
                                "weight": 2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Недотрога",
                                "weight": -2
                            },
                            {
                                "trait": "Осторож. в любви",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Самоуверенный",
                        "map": [
                            {
                                "trait": "Непостоянный",
                                "weight": -1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": -1
                            },
                            {
                                "trait": "Холерик",
                                "weight": -1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Свой в доску",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": 1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": 1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -1
                            }
                        ]
                    },
                    {
                        "value": "Семьянин",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": 1
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": -2
                            },
                            {
                                "trait": "Против детей",
                                "weight": -2
                            },
                            {
                                "trait": "Семьянин",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Сноб",
                        "map": [
                            {
                                "trait": "Вечное дитя",
                                "weight": -2
                            },
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": -1
                            },
                            {
                                "trait": "Клептоман",
                                "weight": -1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -2
                            },
                            {
                                "trait": "Практичный",
                                "weight": 1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": -2
                            },
                            {
                                "trait": "Сноб",
                                "weight": 2
                            },
                            {
                                "trait": "Фриган",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Танцмашина",
                        "map": [
                            {
                                "trait": "Танцмашина",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Творец",
                        "map": [
                            {
                                "trait": "Гений",
                                "weight": -1
                            },
                            {
                                "trait": "Гик",
                                "weight": -1
                            },
                            {
                                "trait": "Искусствовед",
                                "weight": 1
                            },
                            {
                                "trait": "Книжный червь",
                                "weight": -1
                            },
                            {
                                "trait": "Меломан",
                                "weight": 1
                            },
                            {
                                "trait": "Растяпа",
                                "weight": 1
                            },
                            {
                                "trait": "Творец",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Тяга к корням",
                        "map": [
                            {
                                "trait": "Тяга к корням",
                                "weight": 2
                            },
                            {
                                "trait": "Дитя острова",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Уважительный",
                        "map": [
                            {
                                "trait": "Уважительный",
                                "weight": 2
                            },
                            {
                                "trait": "Задира",
                                "weight": -2
                            },
                            {
                                "trait": "Кринжовый",
                                "weight": -2
                            },
                            {
                                "trait": "Неряха",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Угрюмый",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -2
                            },
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Дружелюбный",
                                "weight": -1
                            },
                            {
                                "trait": "Душа компании",
                                "weight": -2
                            },
                            {
                                "trait": "Против детей",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Свой в доску",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": 2
                            },
                            {
                                "trait": "Холерик",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Умелец",
                        "map": [
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Неуклюжый",
                                "weight": -2
                            },
                            {
                                "trait": "Умелец",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Фриган",
                        "map": [
                            {
                                "trait": "Гурман",
                                "weight": -2
                            },
                            {
                                "trait": "Карьерист",
                                "weight": -2
                            },
                            {
                                "trait": "Практичный",
                                "weight": -2
                            },
                            {
                                "trait": "Привереда",
                                "weight": -2
                            },
                            {
                                "trait": "Сноб",
                                "weight": -2
                            },
                            {
                                "trait": "Фриган",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Холерик",
                        "map": [
                            {
                                "trait": "Веселый",
                                "weight": -2
                            },
                            {
                                "trait": "Добрый",
                                "weight": -1
                            },
                            {
                                "trait": "Задира",
                                "weight": 1
                            },
                            {
                                "trait": "Злой",
                                "weight": 1
                            },
                            {
                                "trait": "Мудрый",
                                "weight": -2
                            },
                            {
                                "trait": "Непостоянный",
                                "weight": 1
                            },
                            {
                                "trait": "Ревнивый",
                                "weight": 1
                            },
                            {
                                "trait": "Самоуверенный",
                                "weight": -1
                            },
                            {
                                "trait": "Угрюмый",
                                "weight": -2
                            },
                            {
                                "trait": "Холерик",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Чистюля",
                        "map": [
                            {
                                "trait": "Карьерист",
                                "weight": 1
                            },
                            {
                                "trait": "Перфекционист",
                                "weight": 1
                            },
                            {
                                "trait": "Чистюля",
                                "weight": 2
                            },
                            {
                                "trait": "Лежебока",
                                "weight": -2
                            },
                            {
                                "trait": "Неряха",
                                "weight": -2
                            }
                        ]
                    },
                    {
                        "value": "Щедрый",
                        "map": [
                            {
                                "trait": "Задира",
                                "weight": -2
                            },
                            {
                                "trait": "Злой",
                                "weight": -2
                            },
                            {
                                "trait": "Обжора",
                                "weight": -2
                            },
                            {
                                "trait": "Практичный",
                                "weight": -2
                            },
                            {
                                "trait": "Щедрый",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Эгоцентричный",
                        "map": [
                            {
                                "trait": "Эгоцентричный",
                                "weight": 2
                            }
                        ]
                    },
                    {
                        "value": "Экоэнтузиаст",
                        "map": [
                            {
                                "trait": "Экоэнтузиаст",
                                "weight": 2
                            }
                        ]
                    }
                ]
            }
        ],
        "randoms": [
            {
                "category": "Цвета",
                "values": [
                    "Белый",
                    "Жёлтый",
                    "Зелёный",
                    "Коричневый",
                    "Красный",
                    "Оранжевый",
                    "Розовый",
                    "Серый",
                    "Синий",
                    "Фиолетовый",
                    "Чёрный"
                ]
            },
            {
                "category": "Музыка",
                "values": [
                    "Авторская песня",
                    "Альтернативная музыка",
                    "Американа",
                    "Блюз",
                    "Дворовая музыка",
                    "Джаз",
                    "Жуткая музыка",
                    "Карнавальная музыка",
                    "Классическая музыка",
                    "Колыбельные",
                    "Латино",
                    "Латиноамериканская поп-музыка",
                    "Лёгкая музыка",
                    "Летняя музыка",
                    "МУЗЫКА В ЖАНРЕ МЕТАЛЛ",
                    "Музыка в жанре ар-н-би",
                    "Музыка в жанре нью-эйдж",
                    "Музыка в жанре ретро",
                    "Музыка в жанре соул",
                    "Музыка в стиле сельской эстетики",
                    "Музыка для детей",
                    "Музыка для концентрации внимания",
                    "Музыка из будки ди-джея",
                    "Музыка мира",
                    "Музыка с острова",
                    "Музыка эпохи барокко",
                    "Поп-музыка",
                    "Поп-музыка для детей",
                    "Рождественская музыка",
                    "Романтическая музыка",
                    "С-поп",
                    "Странные мелодии",
                    "Хип-хоп",
                    "Электронная музыка",
                    "Японская народная музыка"
                ]
            },
            {
                "category": "Отношения",
                "values": [
                    "Вуху",
                    "Дарение подарков",
                    "Любовь",
                    "Физическая близость",
                    "Флирт"
                ]
            }
        ]
    }
}